Тестовая_база_ERP_14/src/AccumulationRegisters/ВытесняемоеПлановоеВремяСотрудников/ВытесняемоеПлановоеВремяСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВытесняемоеПлановоеВремяСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПереходящаяЧастьПредыдущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходящаяЧастьТекущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Enums/ВидыДанныхУчетаВремениСотрудников/ВидыДанныхУчетаВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДанныхУчетаВремениСотрудников</name>
  <enumValues>
    <name>ДанныеОбщихГрафиков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеИндивидуальныхГрафиков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеТабельногоУчета</name>
  </enumValues>
  <enumValues>
    <name>ДанныеОперативногоУчета</name>
  </enumValues>
  <enumValues>
    <name>ДанныеВнутрисменныхНеявок</name>
  </enumValues>
  <enumValues>
    <name>ВытесняемоеПлановоеВремя</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеВнутрисменноеВремя</name>
  </enumValues>
  <enumValues>
    <name>СводныеДанные</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/AccumulationRegisters/ВытесняемоеПлановоеВремяСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеРегистра() Экспорт
	ОписаниеРегистра = УчетРабочегоВремениРасширенный.ОписаниеРегистраДанныхУчетаВремени();
	
	ОписаниеРегистра.МетаданныеРегистра = Метаданные.РегистрыНакопления.ВытесняемоеПлановоеВремяСотрудников;
	ОписаниеРегистра.ИмяПоляСотрудник = "Сотрудник";
	ОписаниеРегистра.ИмяПоляПериод = "Период";
	ОписаниеРегистра.ИмяПоляПериодРегистрации = "ПериодРегистрации";
	ОписаниеРегистра.ИмяПоляВидДанных = Неопределено;
	ОписаниеРегистра.ВидДанных = Перечисления.ВидыДанныхУчетаВремениСотрудников.ВытесняемоеПлановоеВремя;
	
	Возврат ОписаниеРегистра;
КонецФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ЗаполнитьОрганизацию(ПараметрыОбновления = Неопределено) Экспорт
	
	ПоследнийОбработанныйРегистратор = Неопределено;
	Пока Истина Цикл
		Запрос = ЗарплатаКадрыРасширенный.ЗапросПолученияРегистраторовДляОбработкиЗаполненияОрганизации("ВытесняемоеПлановоеВремяСотрудников", ПоследнийОбработанныйРегистратор);
		
		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		Иначе
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		КонецЕсли;
		
		Регистраторы = Результат.Выгрузить().ВыгрузитьКолонку("Регистратор");
		ОрганизацииДокументов = ОбщегоНазначенияБЗК.ЗначениеРеквизитаОбъектов(Регистраторы, "Организация");
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВытесняемоеПлановоеВремяСотрудников.Период КАК Период,
			|	ВытесняемоеПлановоеВремяСотрудников.Регистратор КАК Регистратор,
			|	ВытесняемоеПлановоеВремяСотрудников.НомерСтроки КАК НомерСтроки,
			|	ВытесняемоеПлановоеВремяСотрудников.Активность КАК Активность,
			|	ВытесняемоеПлановоеВремяСотрудников.Сотрудник КАК Сотрудник,
			|	ВытесняемоеПлановоеВремяСотрудников.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	ВытесняемоеПлановоеВремяСотрудников.ПериодРегистрации КАК ПериодРегистрации,
			|	ВытесняемоеПлановоеВремяСотрудников.ВидУчетаВремени КАК ВидУчетаВремени,
			|	ВытесняемоеПлановоеВремяСотрудников.Часы КАК Часы,
			|	ВытесняемоеПлановоеВремяСотрудников.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
			|	ВытесняемоеПлановоеВремяСотрудников.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены,
			|	ВытесняемоеПлановоеВремяСотрудников.Смена КАК Смена,
			|	ВытесняемоеПлановоеВремяСотрудников.Организация КАК Организация
			|ИЗ
			|	РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников КАК ВытесняемоеПлановоеВремяСотрудников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРегистраторы КАК ВТРегистраторы
			|		ПО ВытесняемоеПлановоеВремяСотрудников.Регистратор = ВТРегистраторы.Регистратор
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВытесняемоеПлановоеВремяСотрудников.Регистратор";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписей = РегистрыНакопления.ВытесняемоеПлановоеВремяСотрудников.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Организация = ОрганизацииДокументов[Выборка.Регистратор];
				Если Не ЗначениеЗаполнено(НоваяСтрока.Организация) Тогда
					НоваяСтрока.Организация = Выборка.ГоловнаяОрганизация;
				КонецЕсли;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
			ПоследнийОбработанныйРегистратор = Выборка.Регистратор;
		КонецЦикла;
		Если ПараметрыОбновления <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
